read_hdl -vhdl memory.vhd
elaborate rv_pipeline_memory
check_design -unresolved
